espressif/esp-idf/components/soc/esp32h2/include/rev2/soc/syscon_reg.h
/** SYSCON_MEM_POWER_DOWN_REG register
 *  register description
 */
#define SYSCON_MEM_POWER_DOWN_REG (DR_REG_SYSCON_BASE + 0xa8)
/** SYSCON_ROM_POWER_DOWN : R/W; bitpos: [1:0]; default: 0;
 *  Need add description
 */
#define SYSCON_ROM_POWER_DOWN    0x00000003U
#define SYSCON_ROM_POWER_DOWN_M  (SYSCON_ROM_POWER_DOWN_V << SYSCON_ROM_POWER_DOWN_S)
#define SYSCON_ROM_POWER_DOWN_V  0x00000003U
#define SYSCON_ROM_POWER_DOWN_S  0
/** SYSCON_SRAM_POWER_DOWN : R/W; bitpos: [5:2]; default: 0;
 *  Need add description
 */
#define SYSCON_SRAM_POWER_DOWN    0x0000000FU
#define SYSCON_SRAM_POWER_DOWN_M  (SYSCON_SRAM_POWER_DOWN_V << SYSCON_SRAM_POWER_DOWN_S)
#define SYSCON_SRAM_POWER_DOWN_V  0x0000000FU
#define SYSCON_SRAM_POWER_DOWN_S  2

/** SYSCON_MEM_POWER_UP_REG register
 *  register description
 */
#define SYSCON_MEM_POWER_UP_REG (DR_REG_SYSCON_BASE + 0xac)
/** SYSCON_ROM_POWER_UP : R/W; bitpos: [1:0]; default: 3;
 *  Need add description
 */
#define SYSCON_ROM_POWER_UP    0x00000003U
#define SYSCON_ROM_POWER_UP_M  (SYSCON_ROM_POWER_UP_V << SYSCON_ROM_POWER_UP_S)
#define SYSCON_ROM_POWER_UP_V  0x00000003U
#define SYSCON_ROM_POWER_UP_S  0
/** SYSCON_SRAM_POWER_UP : R/W; bitpos: [5:2]; default: 15;
 *  Need add description
 */
#define SYSCON_SRAM_POWER_UP    0x0000000FU
#define SYSCON_SRAM_POWER_UP_M  (SYSCON_SRAM_POWER_UP_V << SYSCON_SRAM_POWER_UP_S)
#define SYSCON_SRAM_POWER_UP_V  0x0000000FU
#define SYSCON_SRAM_POWER_UP_S  2

/** SYSCON_RND_DATA_REG register
 *  register description
 */
#define SYSCON_RND_DATA_REG (DR_REG_SYSCON_BASE + 0xb0)
/** SYSCON_RND_DATA : RO; bitpos: [31:0]; default: 0;
 *  Need add description
 */
#define SYSCON_RND_DATA    0xFFFFFFFFU
#define SYSCON_RND_DATA_M  (SYSCON_RND_DATA_V << SYSCON_RND_DATA_S)
#define SYSCON_RND_DATA_V  0xFFFFFFFFU
#define SYSCON_RND_DATA_S  0

/** SYSCON_PERI_BACKUP_CONFIG_REG register
 *  register description
 */
#define SYSCON_PERI_BACKUP_CONFIG_REG (DR_REG_SYSCON_BASE + 0xb4)
/** SYSCON_PERI_BACKUP_FLOW_ERR : RO; bitpos: [2:0]; default: 0;
 *  Need add description
 */
#define SYSCON_PERI_BACKUP_FLOW_ERR    0x00000007U
#define SYSCON_PERI_BACKUP_FLOW_ERR_M  (SYSCON_PERI_BACKUP_FLOW_ERR_V << SYSCON_PERI_BACKUP_FLOW_ERR_S)
#define SYSCON_PERI_BACKUP_FLOW_ERR_V  0x00000007U
#define SYSCON_PERI_BACKUP_FLOW_ERR_S  0
/** SYSCON_PERI_BACKUP_ADDR_MAP_MODE : R/W; bitpos: [3]; default: 0;
 *  Need add description
 */
#define SYSCON_PERI_BACKUP_ADDR_MAP_MODE    (BIT(3))
#define SYSCON_PERI_BACKUP_ADDR_MAP_MODE_M  (SYSCON_PERI_BACKUP_ADDR_MAP_MODE_V << SYSCON_PERI_BACKUP_ADDR_MAP_MODE_S)
#define SYSCON_PERI_BACKUP_ADDR_MAP_MODE_V  0x00000001U
#define SYSCON_PERI_BACKUP_ADDR_MAP_MODE_S  3
/** SYSCON_PERI_BACKUP_BURST_LIMIT : R/W; bitpos: [8:4]; default: 8;
 *  Need add description
 */
#define SYSCON_PERI_BACKUP_BURST_LIMIT    0x0000001FU
#define SYSCON_PERI_BACKUP_BURST_LIMIT_M  (SYSCON_PERI_BACKUP_BURST_LIMIT_V << SYSCON_PERI_BACKUP_BURST_LIMIT_S)
#define SYSCON_PERI_BACKUP_BURST_LIMIT_V  0x0000001FU
#define SYSCON_PERI_BACKUP_BURST_LIMIT_S  4
/** SYSCON_PERI_BACKUP_TOUT_THRES : R/W; bitpos: [18:9]; default: 50;
 *  Need add description
 */
#define SYSCON_PERI_BACKUP_TOUT_THRES    0x000003FFU
#define SYSCON_PERI_BACKUP_TOUT_THRES_M  (SYSCON_PERI_BACKUP_TOUT_THRES_V << SYSCON_PERI_BACKUP_TOUT_THRES_S)
#define SYSCON_PERI_BACKUP_TOUT_THRES_V  0x000003FFU
#define SYSCON_PERI_BACKUP_TOUT_THRES_S  9
/** SYSCON_PERI_BACKUP_SIZE : R/W; bitpos: [28:19]; default: 0;
 *  Need add description
 */
#define SYSCON_PERI_BACKUP_SIZE    0x000003FFU
#define SYSCON_PERI_BACKUP_SIZE_M  (SYSCON_PERI_BACKUP_SIZE_V << SYSCON_PERI_BACKUP_SIZE_S)
#define SYSCON_PERI_BACKUP_SIZE_V  0x000003FFU
#define SYSCON_PERI_BACKUP_SIZE_S  19
/** SYSCON_PERI_BACKUP_START : WO; bitpos: [29]; default: 0;
 *  Need add description
 */
#define SYSCON_PERI_BACKUP_START    (BIT(29))
#define SYSCON_PERI_BACKUP_START_M  (SYSCON_PERI_BACKUP_START_V << SYSCON_PERI_BACKUP_START_S)
#define SYSCON_PERI_BACKUP_START_V  0x00000001U
#define SYSCON_PERI_BACKUP_START_S  29
/** SYSCON_PERI_BACKUP_TO_MEM : R/W; bitpos: [30]; default: 0;
 *  Need add description
 */
#define SYSCON_PERI_BACKUP_TO_MEM    (BIT(30))
#define SYSCON_PERI_BACKUP_TO_MEM_M  (SYSCON_PERI_BACKUP_TO_MEM_V << SYSCON_PERI_BACKUP_TO_MEM_S)
#define SYSCON_PERI_BACKUP_TO_MEM_V  0x00000001U
#define SYSCON_PERI_BACKUP_TO_MEM_S  30
/** SYSCON_PERI_BACKUP_ENA : R/W; bitpos: [31]; default: 0;
 *  Need add description
 */
#define SYSCON_PERI_BACKUP_ENA    (BIT(31))
#define SYSCON_PERI_BACKUP_ENA_M  (SYSCON_PERI_BACKUP_ENA_V << SYSCON_PERI_BACKUP_ENA_S)
#define SYSCON_PERI_BACKUP_ENA_V  0x00000001U
#define SYSCON_PERI_BACKUP_ENA_S  31

/** SYSCON_PERI_BACKUP_APB_ADDR_REG register
 *  register description
 */
#define SYSCON_PERI_BACKUP_APB_ADDR_REG (DR_REG_SYSCON_BASE + 0xb8)
/** SYSCON_PERI_BACKUP_APB_START_ADDR : R/W; bitpos: [31:0]; default: 0;
 *  Need add description
 */
#define SYSCON_PERI_BACKUP_APB_START_ADDR    0xFFFFFFFFU
#define SYSCON_PERI_BACKUP_APB_START_ADDR_M  (SYSCON_PERI_BACKUP_APB_START_ADDR_V << SYSCON_PERI_BACKUP_APB_START_ADDR_S)
#define SYSCON_PERI_BACKUP_APB_START_ADDR_V  0xFFFFFFFFU
#define SYSCON_PERI_BACKUP_APB_START_ADDR_S  0

/** SYSCON_PERI_BACKUP_MEM_ADDR_REG register
 *  register description
 */
#define SYSCON_PERI_BACKUP_MEM_ADDR_REG (DR_REG_SYSCON_BASE + 0xbc)
/** SYSCON_PERI_BACKUP_MEM_START_ADDR : R/W; bitpos: [31:0]; default: 0;
 *  Need add description
 */
#define SYSCON_PERI_BACKUP_MEM_START_ADDR    0xFFFFFFFFU
#define SYSCON_PERI_BACKUP_MEM_START_ADDR_M  (SYSCON_PERI_BACKUP_MEM_START_ADDR_V << SYSCON_PERI_BACKUP_MEM_START_ADDR_S)
#define SYSCON_PERI_BACKUP_MEM_START_ADDR_V  0xFFFFFFFFU
#define SYSCON_PERI_BACKUP_MEM_START_ADDR_S  0

/** SYSCON_PERI_BACKUP_REG_MAP0_REG register
 *  register description
 */
#define SYSCON_PERI_BACKUP_REG_MAP0_REG (DR_REG_SYSCON_BASE + 0xc0)
/** SYSCON_PERI_BACKUP_REG_MAP0 : R/W; bitpos: [31:0]; default: 0;
 *  Need add description
 */
#define SYSCON_PERI_BACKUP_REG_MAP0    0xFFFFFFFFU
#define SYSCON_PERI_BACKUP_REG_MAP0_M  (SYSCON_PERI_BACKUP_REG_MAP0_V << SYSCON_PERI_BACKUP_REG_MAP0_S)
#define SYSCON_PERI_BACKUP_REG_MAP0_V  0xFFFFFFFFU
#define SYSCON_PERI_BACKUP_REG_MAP0_S  0

/** SYSCON_PERI_BACKUP_REG_MAP1_REG register
 *  register description
 */
#define SYSCON_PERI_BACKUP_REG_MAP1_REG (DR_REG_SYSCON_BASE + 0xc4)
/** SYSCON_PERI_BACKUP_REG_MAP1 : R/W; bitpos: [31:0]; default: 0;
 *  Need add description
 */
#define SYSCON_PERI_BACKUP_REG_MAP1    0xFFFFFFFFU
#define SYSCON_PERI_BACKUP_REG_MAP1_M  (SYSCON_PERI_BACKUP_REG_MAP1_V << SYSCON_PERI_BACKUP_REG_MAP1_S)
#define SYSCON_PERI_BACKUP_REG_MAP1_V  0xFFFFFFFFU
#define SYSCON_PERI_BACKUP_REG_MAP1_S  0

/** SYSCON_PERI_BACKUP_REG_MAP2_REG register
 *  register description
 */
#define SYSCON_PERI_BACKUP_REG_MAP2_REG (DR_REG_SYSCON_BASE + 0xc8)
/** SYSCON_PERI_BACKUP_REG_MAP2 : R/W; bitpos: [31:0]; default: 0;
 *  Need add description
 */
#define SYSCON_PERI_BACKUP_REG_MAP2    0xFFFFFFFFU
#define SYSCON_PERI_BACKUP_REG_MAP2_M  (SYSCON_PERI_BACKUP_REG_MAP2_V << SYSCON_PERI_BACKUP_REG_MAP2_S)
#define SYSCON_PERI_BACKUP_REG_MAP2_V  0xFFFFFFFFU
#define SYSCON_PERI_BACKUP_REG_MAP2_S  0

